app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy_multiple

    count = 0
    if params[:users]
      count = params[:users].count
      User.destroy(params[:users])