app/controllers/waffles_controller.rb

SELECT "waffles".* FROM "waffles"
---
  def index
    #@waffles = Waffle.all
    @waffles = Waffle.where.not(discount:true)

INSERT INTO "waffles" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dfg"], ["price", 56.0], ["created_at", 2017-03-01 21:32:39 UTC], ["updated_at", 2017-03-01 21:32:39 UTC]]
---
  def create
    @waffle = Waffle.new(waffle_params)

    if @waffle.save

SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @waffle = Waffle.find(params[:id])

SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @waffle = Waffle.find(params[:id])

SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "waffles" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "waffles"."id" = $4  [["name", "Suchy"], ["price", 3.5], ["updated_at", 2017-03-06 12:06:53 UTC], ["id", 1]]
---
  def update
    @waffle = Waffle.find(params[:id])

    if @waffle.update(waffle_params)

DELETE FROM "waffles" WHERE "waffles"."id" = $1  [["id", 6]]
---
  def destroy
    Waffle.destroy(params[:id])

DELETE FROM "waffles" WHERE "waffles"."id" = $1  [["id", 3]]
---
  def destroy_multiple
    Waffle.destroy(params[:waffles])